GopalSaraf/Practicals/PSDL/include/proc/pic18lf2580.inc
// Register: B4SIDL
#define B4SIDL B4SIDL
B4SIDL                                   equ 0E62h
// bitfield definitions
B4SIDL_EID16_POSN                        equ 0000h
B4SIDL_EID16_POSITION                    equ 0000h
B4SIDL_EID16_SIZE                        equ 0001h
B4SIDL_EID16_LENGTH                      equ 0001h
B4SIDL_EID16_MASK                        equ 0001h
B4SIDL_EID17_POSN                        equ 0001h
B4SIDL_EID17_POSITION                    equ 0001h
B4SIDL_EID17_SIZE                        equ 0001h
B4SIDL_EID17_LENGTH                      equ 0001h
B4SIDL_EID17_MASK                        equ 0002h
B4SIDL_EXIDE_POSN                        equ 0003h
B4SIDL_EXIDE_POSITION                    equ 0003h
B4SIDL_EXIDE_SIZE                        equ 0001h
B4SIDL_EXIDE_LENGTH                      equ 0001h
B4SIDL_EXIDE_MASK                        equ 0008h
B4SIDL_SRR_POSN                          equ 0004h
B4SIDL_SRR_POSITION                      equ 0004h
B4SIDL_SRR_SIZE                          equ 0001h
B4SIDL_SRR_LENGTH                        equ 0001h
B4SIDL_SRR_MASK                          equ 0010h
B4SIDL_SID0_POSN                         equ 0005h
B4SIDL_SID0_POSITION                     equ 0005h
B4SIDL_SID0_SIZE                         equ 0001h
B4SIDL_SID0_LENGTH                       equ 0001h
B4SIDL_SID0_MASK                         equ 0020h
B4SIDL_SID1_POSN                         equ 0006h
B4SIDL_SID1_POSITION                     equ 0006h
B4SIDL_SID1_SIZE                         equ 0001h
B4SIDL_SID1_LENGTH                       equ 0001h
B4SIDL_SID1_MASK                         equ 0040h
B4SIDL_SID2_POSN                         equ 0007h
B4SIDL_SID2_POSITION                     equ 0007h
B4SIDL_SID2_SIZE                         equ 0001h
B4SIDL_SID2_LENGTH                       equ 0001h
B4SIDL_SID2_MASK                         equ 0080h
B4SIDL_EXID_POSN                         equ 0003h
B4SIDL_EXID_POSITION                     equ 0003h
B4SIDL_EXID_SIZE                         equ 0001h
B4SIDL_EXID_LENGTH                       equ 0001h
B4SIDL_EXID_MASK                         equ 0008h
B4SIDL_B4EID16_POSN                      equ 0000h
B4SIDL_B4EID16_POSITION                  equ 0000h
B4SIDL_B4EID16_SIZE                      equ 0001h
B4SIDL_B4EID16_LENGTH                    equ 0001h
B4SIDL_B4EID16_MASK                      equ 0001h
B4SIDL_B4EID17_POSN                      equ 0001h
B4SIDL_B4EID17_POSITION                  equ 0001h
B4SIDL_B4EID17_SIZE                      equ 0001h
B4SIDL_B4EID17_LENGTH                    equ 0001h
B4SIDL_B4EID17_MASK                      equ 0002h
B4SIDL_B4EXID_POSN                       equ 0003h
B4SIDL_B4EXID_POSITION                   equ 0003h
B4SIDL_B4EXID_SIZE                       equ 0001h
B4SIDL_B4EXID_LENGTH                     equ 0001h
B4SIDL_B4EXID_MASK                       equ 0008h
B4SIDL_B4SRR_POSN                        equ 0004h
B4SIDL_B4SRR_POSITION                    equ 0004h
B4SIDL_B4SRR_SIZE                        equ 0001h
B4SIDL_B4SRR_LENGTH                      equ 0001h
B4SIDL_B4SRR_MASK                        equ 0010h
B4SIDL_B4SID0_POSN                       equ 0005h
B4SIDL_B4SID0_POSITION                   equ 0005h
B4SIDL_B4SID0_SIZE                       equ 0001h
B4SIDL_B4SID0_LENGTH                     equ 0001h
B4SIDL_B4SID0_MASK                       equ 0020h
B4SIDL_B4SID1_POSN                       equ 0006h
B4SIDL_B4SID1_POSITION                   equ 0006h
B4SIDL_B4SID1_SIZE                       equ 0001h
B4SIDL_B4SID1_LENGTH                     equ 0001h
B4SIDL_B4SID1_MASK                       equ 0040h
B4SIDL_B4SID2_POSN                       equ 0007h
B4SIDL_B4SID2_POSITION                   equ 0007h
B4SIDL_B4SID2_SIZE                       equ 0001h
B4SIDL_B4SID2_LENGTH                     equ 0001h
B4SIDL_B4SID2_MASK                       equ 0080h
B4SIDL_B4EXIDE_POSN                      equ 0003h
B4SIDL_B4EXIDE_POSITION                  equ 0003h
B4SIDL_B4EXIDE_SIZE                      equ 0001h
B4SIDL_B4EXIDE_LENGTH                    equ 0001h
B4SIDL_B4EXIDE_MASK                      equ 0008h

// Register: B4EIDH
#define B4EIDH B4EIDH
B4EIDH                                   equ 0E63h
// bitfield definitions
B4EIDH_EID8_POSN                         equ 0000h
B4EIDH_EID8_POSITION                     equ 0000h
B4EIDH_EID8_SIZE                         equ 0001h
B4EIDH_EID8_LENGTH                       equ 0001h
B4EIDH_EID8_MASK                         equ 0001h
B4EIDH_EID9_POSN                         equ 0001h
B4EIDH_EID9_POSITION                     equ 0001h
B4EIDH_EID9_SIZE                         equ 0001h
B4EIDH_EID9_LENGTH                       equ 0001h
B4EIDH_EID9_MASK                         equ 0002h
B4EIDH_EID10_POSN                        equ 0002h
B4EIDH_EID10_POSITION                    equ 0002h
B4EIDH_EID10_SIZE                        equ 0001h
B4EIDH_EID10_LENGTH                      equ 0001h
B4EIDH_EID10_MASK                        equ 0004h
B4EIDH_EID11_POSN                        equ 0003h
B4EIDH_EID11_POSITION                    equ 0003h
B4EIDH_EID11_SIZE                        equ 0001h
B4EIDH_EID11_LENGTH                      equ 0001h
B4EIDH_EID11_MASK                        equ 0008h
B4EIDH_EID12_POSN                        equ 0004h
B4EIDH_EID12_POSITION                    equ 0004h
B4EIDH_EID12_SIZE                        equ 0001h
B4EIDH_EID12_LENGTH                      equ 0001h
B4EIDH_EID12_MASK                        equ 0010h
B4EIDH_EID13_POSN                        equ 0005h
B4EIDH_EID13_POSITION                    equ 0005h
B4EIDH_EID13_SIZE                        equ 0001h
B4EIDH_EID13_LENGTH                      equ 0001h
B4EIDH_EID13_MASK                        equ 0020h
B4EIDH_EID14_POSN                        equ 0006h
B4EIDH_EID14_POSITION                    equ 0006h
B4EIDH_EID14_SIZE                        equ 0001h
B4EIDH_EID14_LENGTH                      equ 0001h
B4EIDH_EID14_MASK                        equ 0040h
B4EIDH_EID15_POSN                        equ 0007h
B4EIDH_EID15_POSITION                    equ 0007h
B4EIDH_EID15_SIZE                        equ 0001h
B4EIDH_EID15_LENGTH                      equ 0001h
B4EIDH_EID15_MASK                        equ 0080h
B4EIDH_B4EID8_POSN                       equ 0000h
B4EIDH_B4EID8_POSITION                   equ 0000h
B4EIDH_B4EID8_SIZE                       equ 0001h
B4EIDH_B4EID8_LENGTH                     equ 0001h
B4EIDH_B4EID8_MASK                       equ 0001h
B4EIDH_B4EID9_POSN                       equ 0001h
B4EIDH_B4EID9_POSITION                   equ 0001h
B4EIDH_B4EID9_SIZE                       equ 0001h
B4EIDH_B4EID9_LENGTH                     equ 0001h
B4EIDH_B4EID9_MASK                       equ 0002h
B4EIDH_B4EID10_POSN                      equ 0002h
B4EIDH_B4EID10_POSITION                  equ 0002h
B4EIDH_B4EID10_SIZE                      equ 0001h
B4EIDH_B4EID10_LENGTH                    equ 0001h
B4EIDH_B4EID10_MASK                      equ 0004h
B4EIDH_B4EID11_POSN                      equ 0003h
B4EIDH_B4EID11_POSITION                  equ 0003h
B4EIDH_B4EID11_SIZE                      equ 0001h
B4EIDH_B4EID11_LENGTH                    equ 0001h
B4EIDH_B4EID11_MASK                      equ 0008h
B4EIDH_B4EID12_POSN                      equ 0004h
B4EIDH_B4EID12_POSITION                  equ 0004h
B4EIDH_B4EID12_SIZE                      equ 0001h
B4EIDH_B4EID12_LENGTH                    equ 0001h
B4EIDH_B4EID12_MASK                      equ 0010h
B4EIDH_B4EID13_POSN                      equ 0005h
B4EIDH_B4EID13_POSITION                  equ 0005h
B4EIDH_B4EID13_SIZE                      equ 0001h
B4EIDH_B4EID13_LENGTH                    equ 0001h
B4EIDH_B4EID13_MASK                      equ 0020h
B4EIDH_B4EID14_POSN                      equ 0006h
B4EIDH_B4EID14_POSITION                  equ 0006h
B4EIDH_B4EID14_SIZE                      equ 0001h
B4EIDH_B4EID14_LENGTH                    equ 0001h
B4EIDH_B4EID14_MASK                      equ 0040h
B4EIDH_B4EID15_POSN                      equ 0007h
B4EIDH_B4EID15_POSITION                  equ 0007h
B4EIDH_B4EID15_SIZE                      equ 0001h
B4EIDH_B4EID15_LENGTH                    equ 0001h
B4EIDH_B4EID15_MASK                      equ 0080h

// Register: B4EIDL
#define B4EIDL B4EIDL
B4EIDL                                   equ 0E64h
// bitfield definitions
B4EIDL_EID0_POSN                         equ 0000h
B4EIDL_EID0_POSITION                     equ 0000h
B4EIDL_EID0_SIZE                         equ 0001h
B4EIDL_EID0_LENGTH                       equ 0001h
B4EIDL_EID0_MASK                         equ 0001h
B4EIDL_EID1_POSN                         equ 0001h
B4EIDL_EID1_POSITION                     equ 0001h
B4EIDL_EID1_SIZE                         equ 0001h
B4EIDL_EID1_LENGTH                       equ 0001h
B4EIDL_EID1_MASK                         equ 0002h
B4EIDL_EID2_POSN                         equ 0002h
B4EIDL_EID2_POSITION                     equ 0002h
B4EIDL_EID2_SIZE                         equ 0001h
B4EIDL_EID2_LENGTH                       equ 0001h
B4EIDL_EID2_MASK                         equ 0004h
B4EIDL_EID3_POSN                         equ 0003h
B4EIDL_EID3_POSITION                     equ 0003h
B4EIDL_EID3_SIZE                         equ 0001h
B4EIDL_EID3_LENGTH                       equ 0001h
B4EIDL_EID3_MASK                         equ 0008h
B4EIDL_EID4_POSN                         equ 0004h
B4EIDL_EID4_POSITION                     equ 0004h
B4EIDL_EID4_SIZE                         equ 0001h
B4EIDL_EID4_LENGTH                       equ 0001h
B4EIDL_EID4_MASK                         equ 0010h
B4EIDL_EID5_POSN                         equ 0005h
B4EIDL_EID5_POSITION                     equ 0005h
B4EIDL_EID5_SIZE                         equ 0001h
B4EIDL_EID5_LENGTH                       equ 0001h
B4EIDL_EID5_MASK                         equ 0020h
B4EIDL_EID6_POSN                         equ 0006h
B4EIDL_EID6_POSITION                     equ 0006h
B4EIDL_EID6_SIZE                         equ 0001h
B4EIDL_EID6_LENGTH                       equ 0001h
B4EIDL_EID6_MASK                         equ 0040h
B4EIDL_EID7_POSN                         equ 0007h
B4EIDL_EID7_POSITION                     equ 0007h
B4EIDL_EID7_SIZE                         equ 0001h
B4EIDL_EID7_LENGTH                       equ 0001h
B4EIDL_EID7_MASK                         equ 0080h
B4EIDL_B4EID0_POSN                       equ 0000h
B4EIDL_B4EID0_POSITION                   equ 0000h
B4EIDL_B4EID0_SIZE                       equ 0001h
B4EIDL_B4EID0_LENGTH                     equ 0001h
B4EIDL_B4EID0_MASK                       equ 0001h
B4EIDL_B4EID1_POSN                       equ 0001h
B4EIDL_B4EID1_POSITION                   equ 0001h
B4EIDL_B4EID1_SIZE                       equ 0001h
B4EIDL_B4EID1_LENGTH                     equ 0001h
B4EIDL_B4EID1_MASK                       equ 0002h
B4EIDL_B4EID2_POSN                       equ 0002h
B4EIDL_B4EID2_POSITION                   equ 0002h
B4EIDL_B4EID2_SIZE                       equ 0001h
B4EIDL_B4EID2_LENGTH                     equ 0001h
B4EIDL_B4EID2_MASK                       equ 0004h
B4EIDL_B4EID3_POSN                       equ 0003h
B4EIDL_B4EID3_POSITION                   equ 0003h
B4EIDL_B4EID3_SIZE                       equ 0001h
B4EIDL_B4EID3_LENGTH                     equ 0001h
B4EIDL_B4EID3_MASK                       equ 0008h
B4EIDL_B4EID4_POSN                       equ 0004h
B4EIDL_B4EID4_POSITION                   equ 0004h
B4EIDL_B4EID4_SIZE                       equ 0001h
B4EIDL_B4EID4_LENGTH                     equ 0001h
B4EIDL_B4EID4_MASK                       equ 0010h
B4EIDL_B4EID5_POSN                       equ 0005h
B4EIDL_B4EID5_POSITION                   equ 0005h
B4EIDL_B4EID5_SIZE                       equ 0001h
B4EIDL_B4EID5_LENGTH                     equ 0001h
B4EIDL_B4EID5_MASK                       equ 0020h
B4EIDL_B4EID6_POSN                       equ 0006h
B4EIDL_B4EID6_POSITION                   equ 0006h
B4EIDL_B4EID6_SIZE                       equ 0001h
B4EIDL_B4EID6_LENGTH                     equ 0001h
B4EIDL_B4EID6_MASK                       equ 0040h
B4EIDL_B4EID7_POSN                       equ 0007h
B4EIDL_B4EID7_POSITION                   equ 0007h
B4EIDL_B4EID7_SIZE                       equ 0001h
B4EIDL_B4EID7_LENGTH                     equ 0001h
B4EIDL_B4EID7_MASK                       equ 0080h

// Register: B4DLC
#define B4DLC B4DLC
B4DLC                                    equ 0E65h
// bitfield definitions
B4DLC_DLC0_POSN                          equ 0000h
B4DLC_DLC0_POSITION                      equ 0000h
B4DLC_DLC0_SIZE                          equ 0001h
B4DLC_DLC0_LENGTH                        equ 0001h
B4DLC_DLC0_MASK                          equ 0001h
B4DLC_DLC1_POSN                          equ 0001h
B4DLC_DLC1_POSITION                      equ 0001h
B4DLC_DLC1_SIZE                          equ 0001h
B4DLC_DLC1_LENGTH                        equ 0001h
B4DLC_DLC1_MASK                          equ 0002h
B4DLC_DLC2_POSN                          equ 0002h
B4DLC_DLC2_POSITION                      equ 0002h
B4DLC_DLC2_SIZE                          equ 0001h
B4DLC_DLC2_LENGTH                        equ 0001h
B4DLC_DLC2_MASK                          equ 0004h
B4DLC_DLC3_POSN                          equ 0003h
B4DLC_DLC3_POSITION                      equ 0003h
B4DLC_DLC3_SIZE                          equ 0001h
B4DLC_DLC3_LENGTH                        equ 0001h
B4DLC_DLC3_MASK                          equ 0008h
B4DLC_RB0_POSN                           equ 0004h
B4DLC_RB0_POSITION                       equ 0004h
B4DLC_RB0_SIZE                           equ 0001h
B4DLC_RB0_LENGTH                         equ 0001h
B4DLC_RB0_MASK                           equ 0010h
B4DLC_RB1_POSN                           equ 0005h
B4DLC_RB1_POSITION                       equ 0005h
B4DLC_RB1_SIZE                           equ 0001h
B4DLC_RB1_LENGTH                         equ 0001h
B4DLC_RB1_MASK                           equ 0020h
B4DLC_RXRTR_TXRTR_POSN                   equ 0006h
B4DLC_RXRTR_TXRTR_POSITION               equ 0006h
B4DLC_RXRTR_TXRTR_SIZE                   equ 0001h
B4DLC_RXRTR_TXRTR_LENGTH                 equ 0001h
B4DLC_RXRTR_TXRTR_MASK                   equ 0040h
B4DLC_RESRB0_POSN                        equ 0004h
B4DLC_RESRB0_POSITION                    equ 0004h
B4DLC_RESRB0_SIZE                        equ 0001h
B4DLC_RESRB0_LENGTH                      equ 0001h
B4DLC_RESRB0_MASK                        equ 0010h
B4DLC_RESRB1_POSN                        equ 0005h
B4DLC_RESRB1_POSITION                    equ 0005h
B4DLC_RESRB1_SIZE                        equ 0001h
B4DLC_RESRB1_LENGTH                      equ 0001h
B4DLC_RESRB1_MASK                        equ 0020h
B4DLC_TXRTR_POSN                         equ 0006h
B4DLC_TXRTR_POSITION                     equ 0006h
B4DLC_TXRTR_SIZE                         equ 0001h
B4DLC_TXRTR_LENGTH                       equ 0001h
B4DLC_TXRTR_MASK                         equ 0040h
B4DLC_RXRTR_POSN                         equ 0006h
B4DLC_RXRTR_POSITION                     equ 0006h
B4DLC_RXRTR_SIZE                         equ 0001h
B4DLC_RXRTR_LENGTH                       equ 0001h
B4DLC_RXRTR_MASK                         equ 0040h
B4DLC_B4DLC0_POSN                        equ 0000h
B4DLC_B4DLC0_POSITION                    equ 0000h
B4DLC_B4DLC0_SIZE                        equ 0001h
B4DLC_B4DLC0_LENGTH                      equ 0001h
B4DLC_B4DLC0_MASK                        equ 0001h
B4DLC_B4DLC1_POSN                        equ 0001h
B4DLC_B4DLC1_POSITION                    equ 0001h
B4DLC_B4DLC1_SIZE                        equ 0001h
B4DLC_B4DLC1_LENGTH                      equ 0001h
B4DLC_B4DLC1_MASK                        equ 0002h
B4DLC_B4DLC2_POSN                        equ 0002h
B4DLC_B4DLC2_POSITION                    equ 0002h
B4DLC_B4DLC2_SIZE                        equ 0001h
B4DLC_B4DLC2_LENGTH                      equ 0001h
B4DLC_B4DLC2_MASK                        equ 0004h
B4DLC_B4DLC3_POSN                        equ 0003h
B4DLC_B4DLC3_POSITION                    equ 0003h
B4DLC_B4DLC3_SIZE                        equ 0001h
B4DLC_B4DLC3_LENGTH                      equ 0001h
B4DLC_B4DLC3_MASK                        equ 0008h
B4DLC_B4RB0_POSN                         equ 0004h
B4DLC_B4RB0_POSITION                     equ 0004h
B4DLC_B4RB0_SIZE                         equ 0001h
B4DLC_B4RB0_LENGTH                       equ 0001h
B4DLC_B4RB0_MASK                         equ 0010h
B4DLC_B4RB1_POSN                         equ 0005h
B4DLC_B4RB1_POSITION                     equ 0005h
B4DLC_B4RB1_SIZE                         equ 0001h
B4DLC_B4RB1_LENGTH                       equ 0001h
B4DLC_B4RB1_MASK                         equ 0020h
B4DLC_B4RXRTR_POSN                       equ 0006h
B4DLC_B4RXRTR_POSITION                   equ 0006h
B4DLC_B4RXRTR_SIZE                       equ 0001h
B4DLC_B4RXRTR_LENGTH                     equ 0001h
B4DLC_B4RXRTR_MASK                       equ 0040h

// Register: B4D0
#define B4D0 B4D0
B4D0                                     equ 0E66h
// bitfield definitions
B4D0_B4D00_POSN                          equ 0000h
B4D0_B4D00_POSITION                      equ 0000h
B4D0_B4D00_SIZE                          equ 0001h
B4D0_B4D00_LENGTH                        equ 0001h
B4D0_B4D00_MASK                          equ 0001h
B4D0_B4D01_POSN                          equ 0001h
B4D0_B4D01_POSITION                      equ 0001h
B4D0_B4D01_SIZE                          equ 0001h
B4D0_B4D01_LENGTH                        equ 0001h
B4D0_B4D01_MASK                          equ 0002h
B4D0_B4D02_POSN                          equ 0002h
B4D0_B4D02_POSITION                      equ 0002h
B4D0_B4D02_SIZE                          equ 0001h
B4D0_B4D02_LENGTH                        equ 0001h
B4D0_B4D02_MASK                          equ 0004h
B4D0_B4D03_POSN                          equ 0003h
B4D0_B4D03_POSITION                      equ 0003h
B4D0_B4D03_SIZE                          equ 0001h
B4D0_B4D03_LENGTH                        equ 0001h
B4D0_B4D03_MASK                          equ 0008h
B4D0_B4D04_POSN                          equ 0004h
B4D0_B4D04_POSITION                      equ 0004h
B4D0_B4D04_SIZE                          equ 0001h
B4D0_B4D04_LENGTH                        equ 0001h
B4D0_B4D04_MASK                          equ 0010h
B4D0_B4D05_POSN                          equ 0005h
B4D0_B4D05_POSITION                      equ 0005h
B4D0_B4D05_SIZE                          equ 0001h
B4D0_B4D05_LENGTH                        equ 0001h
B4D0_B4D05_MASK                          equ 0020h
B4D0_B4D06_POSN                          equ 0006h
B4D0_B4D06_POSITION                      equ 0006h
B4D0_B4D06_SIZE                          equ 0001h
B4D0_B4D06_LENGTH                        equ 0001h
B4D0_B4D06_MASK                          equ 0040h
B4D0_B4D07_POSN                          equ 0007h
B4D0_B4D07_POSITION                      equ 0007h
B4D0_B4D07_SIZE                          equ 0001h
B4D0_B4D07_LENGTH                        equ 0001h
B4D0_B4D07_MASK                          equ 0080h

// Register: B4D1
#define B4D1 B4D1
B4D1                                     equ 0E67h
// bitfield definitions
B4D1_B4D10_POSN                          equ 0000h
B4D1_B4D10_POSITION                      equ 0000h
B4D1_B4D10_SIZE                          equ 0001h
B4D1_B4D10_LENGTH                        equ 0001h
B4D1_B4D10_MASK                          equ 0001h
B4D1_B4D11_POSN                          equ 0001h
B4D1_B4D11_POSITION                      equ 0001h
B4D1_B4D11_SIZE                          equ 0001h
B4D1_B4D11_LENGTH                        equ 0001h
B4D1_B4D11_MASK                          equ 0002h
B4D1_B4D12_POSN                          equ 0002h
B4D1_B4D12_POSITION                      equ 0002h
B4D1_B4D12_SIZE                          equ 0001h
B4D1_B4D12_LENGTH                        equ 0001h
B4D1_B4D12_MASK                          equ 0004h
B4D1_B4D13_POSN                          equ 0003h
B4D1_B4D13_POSITION                      equ 0003h
B4D1_B4D13_SIZE                          equ 0001h
B4D1_B4D13_LENGTH                        equ 0001h
B4D1_B4D13_MASK                          equ 0008h
B4D1_B4D14_POSN                          equ 0004h
B4D1_B4D14_POSITION                      equ 0004h
B4D1_B4D14_SIZE                          equ 0001h
B4D1_B4D14_LENGTH                        equ 0001h
B4D1_B4D14_MASK                          equ 0010h
B4D1_B4D15_POSN                          equ 0005h
B4D1_B4D15_POSITION                      equ 0005h
B4D1_B4D15_SIZE                          equ 0001h
B4D1_B4D15_LENGTH                        equ 0001h
B4D1_B4D15_MASK                          equ 0020h
B4D1_B4D16_POSN                          equ 0006h
B4D1_B4D16_POSITION                      equ 0006h
B4D1_B4D16_SIZE                          equ 0001h
B4D1_B4D16_LENGTH                        equ 0001h
B4D1_B4D16_MASK                          equ 0040h
B4D1_B4D17_POSN                          equ 0007h
B4D1_B4D17_POSITION                      equ 0007h
B4D1_B4D17_SIZE                          equ 0001h
B4D1_B4D17_LENGTH                        equ 0001h
B4D1_B4D17_MASK                          equ 0080h

// Register: B4D2
#define B4D2 B4D2
B4D2                                     equ 0E68h
// bitfield definitions
B4D2_B4D20_POSN                          equ 0000h
B4D2_B4D20_POSITION                      equ 0000h
B4D2_B4D20_SIZE                          equ 0001h
B4D2_B4D20_LENGTH                        equ 0001h
B4D2_B4D20_MASK                          equ 0001h
B4D2_B4D21_POSN                          equ 0001h
B4D2_B4D21_POSITION                      equ 0001h
B4D2_B4D21_SIZE                          equ 0001h
B4D2_B4D21_LENGTH                        equ 0001h
B4D2_B4D21_MASK                          equ 0002h
B4D2_B4D22_POSN                          equ 0002h
B4D2_B4D22_POSITION                      equ 0002h
B4D2_B4D22_SIZE                          equ 0001h
B4D2_B4D22_LENGTH                        equ 0001h
B4D2_B4D22_MASK                          equ 0004h
B4D2_B4D23_POSN                          equ 0003h
B4D2_B4D23_POSITION                      equ 0003h
B4D2_B4D23_SIZE                          equ 0001h
B4D2_B4D23_LENGTH                        equ 0001h
B4D2_B4D23_MASK                          equ 0008h
B4D2_B4D24_POSN                          equ 0004h
B4D2_B4D24_POSITION                      equ 0004h
B4D2_B4D24_SIZE                          equ 0001h
B4D2_B4D24_LENGTH                        equ 0001h
B4D2_B4D24_MASK                          equ 0010h
B4D2_B4D25_POSN                          equ 0005h
B4D2_B4D25_POSITION                      equ 0005h
B4D2_B4D25_SIZE                          equ 0001h
B4D2_B4D25_LENGTH                        equ 0001h
B4D2_B4D25_MASK                          equ 0020h
B4D2_B4D26_POSN                          equ 0006h
B4D2_B4D26_POSITION                      equ 0006h
B4D2_B4D26_SIZE                          equ 0001h
B4D2_B4D26_LENGTH                        equ 0001h
B4D2_B4D26_MASK                          equ 0040h
B4D2_B4D27_POSN                          equ 0007h
B4D2_B4D27_POSITION                      equ 0007h
B4D2_B4D27_SIZE                          equ 0001h
B4D2_B4D27_LENGTH                        equ 0001h
B4D2_B4D27_MASK                          equ 0080h

